package main

import "fmt"

func main() {

	list := []float64{
		//62.98, 40.70, 26.45, 43.40, 25.99, 25.30, 29.87, 29.53, 40.90, //小象
		//21.95, 41.47, //优选
		//49.79,      //pdd
		//8.82, 9.31, //淘宝

		//98.55, 38.35, 158.85, 60.24, 61.23, //小象 上次算到62.98 9.03号
		//45.68, 29.75, 50.18, 44.55, 43.80, 102.92, 31.75, 35.29, 33.19, //小象超市
		//42.83, 4.99, //美团优选
		//21.70, //燃气费
		//9.19

		//10.15
		46.62, 66.38, 40.06, 50.40, 36.85, 121.67, 29.29, 65.26, 46.27, 34.56, //小象超市
		23.93, 20.56, //美团优选

	}

	total := float64(0)

	for _, l := range list {
		total += l
	}

	//水费
	wRate := float64(20.30)
	//电费
	eBill := float64(95.74)
	//燃气费
	gCost := float64(0)

	fmt.Println((total - wRate - eBill - gCost) / 2)
}
